/*****************************************************
*文件名：dht11.h
*作用：	定义了dht11的宏和引脚定义
*		申明了dht11相关的功能函数
*版本：V 0.0.1
*作者：程序小黑
*修改日期：2020/08/08
*****************************************************/
#ifndef _DHT11_H_
#define _DHT11_H_
/*************************包含头文件**********************************/
#include "common.h"
/*************************引脚定义************************************/
sbit Data=P2^6;   //定义数据线
/*************************宏定义**************************************/
/*************************变量定义**************************************/
/*************************函数声明**************************************/
void DHT11_delay_us(unsigned char n);
void DHT11_delay_ms(unsigned int z);
void DHT11_start();
unsigned char DHT11_rec_byte();
void DHT11_receive(unsigned char *rec_dat);

#endif