/******************************************
*文件名：HC573ANDULD2003.C
*作用：实现控制蜂鸣器等功能函数
*版本：V 0.0.1
*作者：程序小黑
*修改日期：2020/07/29
******************************************/

#include "HC573ANDULD2003.h"

/******************************************
*函数名：relay
*输入：on_off
*返回：无
*作用：控制继电器的通断
******************************************/
void relay(unsigned char on_off)
{
	if(on_off)
	{	
		P0&=0xEF;
		P0|=0x10;
	   	P2=(P2&0x1f)|0xa0;	
	   	P2&=0x1f;
	}
	else
	{	
		P0&=0xEF;
		P2=(P2&0x1f)|0xa0;
	   	P2&=0x1f;
	}	
}
/*
void beep_time(unsigned int time)
{
	if(on_off)
	{
	   	P2=(P2&0x1f)|0xa0;
		P0=P0&0XFF;
	   	P2&=0x1f;
	}
	else
	{
		P2=(P2&0x1f)|0xa0;
		P0=P0&0XBF;
	   	P2&=0x1f;
	}
}
*/

/******************************************
*函数名：beep
*输入：on_off
*返回：无
*作用：控制蜂鸣器的通断
******************************************/
void beep(unsigned char on_off)
{
	if(on_off)
	{
	   	P0&=0xBF;
		P0|=0x40;
	   	P2=(P2&0x1f)|0xa0;	
	   	P2&=0x1f;
	}
	else
	{
		P0&=0xBF;
		P2=(P2&0x1f)|0xa0;
	   	P2&=0x1f;
	}
}

