/******************************************
*文件名：infrared.c
*作用：实现红外解码的功能函数
*版本：V 0.0.1
*作者：程序小黑
*完成日期：2020/08/15
******************************************/

#include "infrared.h"

/******************************************
*函数名：led
*输入：	light	选择灯
		on_off  选择状态
*返回：无
*作用：实现点亮或者熄灭指定的LED的功能函数
******************************************/


/******************************************
*函数名：led
*输入：	light	选择灯
		on_off  选择状态
*返回：无
*作用：实现点亮或者熄灭指定的LED的功能函数
******************************************/

