/******************************************
*文件名：LED.C
*作用：实现点亮或者熄灭指定的LED的功能函数
*版本：V 0.0.1
*作者：程序小黑
*完成日期：2020/07/04
******************************************/

#include "led.h"

/******************************************
*函数名：led_init
*输入：无
*返回：无
*作用：led初始化全部熄灭
******************************************/
void led_init()
{	
	P0=0xff;
   	P2=(P2&0x1f)|0x80;
   	P2&=0x1f;
}

/******************************************
*函数名：led
*输入：	light	选择灯
		on_off  选择状态
*返回：无
*作用：实现点亮或者熄灭指定的LED的功能函数
******************************************/
void led(unsigned char light,unsigned char on_off)
{ 	
	P0=~(on_off<<light);//位选 
	P2=(P2&0x1f)|0x80;
   	P2&=0x1f;
}

///******************************************
//*函数名：led
//*输入：	light	选择灯
//		on_off  选择状态
//*返回：无
//*作用：实现点亮或者熄灭指定的LED的功能函数
//******************************************/
//void leds(unsigned char light,unsigned char on_off,unsigned char num)
//{
//	led(light,on_off);	
//}