/**********************************************
*文件名：LED.H
*作用：	定义了LED的宏和引脚定义
*		申明了LED相关的功能函数
*版本：V 0.0.1
*作者：程序小黑
*完成日期：2020/07/04
**********************************************/
#ifndef _LED_H_
#define _LED_H_
/*************************包含头文件**********************************/
#include<reg52.h>
/*************************引脚定义************************************/
/*************************宏定义**************************************/
#define ON   1
#define OFF  0

#define LED0 0
#define LED1 1
#define LED2 2
#define LED3 3
#define LED4 4
#define LED5 5
#define LED6 6
#define LED7 7
/*************************变量定义**************************************/
/*************************函数声明**************************************/
void led_init();
void led(unsigned char light,unsigned char on_off);
#endif