/**********************************************
*文件名：ultrasonic.h
*作用：	定义了超声波的宏和引脚定义
*		申明了超声波相关的功能函数
*版本：V 0.0.1
*作者：程序小黑
*修改日期：2020/08/12
**********************************************/
#ifndef _ULTRASONIC_H_
#define _ULTRASONIC_H_
/*************************包含头文件**********************************/
#include <reg52.h>
#include <intrins.h>
#include "common.h"
/*************************引脚定义************************************/
sbit Trig = P1^0;		//发送端
sbit Echo = P1^1;		//接收端
sbit TX =   P1^0;		//发送端
sbit RX =   P1^1;		//接收端

/*************************宏定义**************************************/
#define somenop {_nop_();_nop_();_nop_();_nop_();_nop_();\    
                 _nop_();_nop_();_nop_();_nop_();_nop_();}//10US 

/*************************变量定义**************************************/
unsigned int distance;
/*************************函数声明**************************************/
void ULT_Init(void);
void ULT_SendWave(void);
void ULT_ReceiveWave(void);
#endif