/******************************************
*文件名：ultrasonic.c
*作用：实现超声波测距
*版本：V 0.0.1
*作者：程序小黑
*修改日期：2020/08/12
******************************************/

#include "ultrasonic.h"

/******************************************
*函数名：ULT_Init
*输入：无
*返回：无
*作用：初始化超声波的时钟和距离
******************************************/
void ULT_Init(void)
{
	TMOD |= 0x11;  //配置定时器工作模式
	TH1 = 0;
    TL1 = 0;
	distance = 0;		
}


/******************************************
*函数名：ULT_SendWave
*输入：无
*返回：无
*作用：超声波发送8个脉冲
******************************************/
void ULT_SendWave(void)
{
	u16 i = 8;
	do
	{
		TX = 1;
		somenop
		TX = 0;
		somenop
	}
	while(i--);
}

/******************************************
*函数名：ULT_ReceiveWave
*输入：无
*返回：无
*作用：接收脉冲波并计算距离,distance为距离
******************************************/
void ULT_ReceiveWave(void)
{
	unsigned int t = 0;
	TR1 = 1;  							//启动计时
	while((RX == 1) && (TF1 == 0));   	//等待收到脉冲
	TR1 = 0;  							//关闭计时	
	
	if(TF1 == 1)						//发生溢出
	{
		TF1 = 0;
		distance = 9999;  				//无返回
	}
	else
	{
		/**  计算时间  **/
		t = TH1;
		t <<= 8;
		t |= TL1;
		distance = (unsigned int)(t *0.0172);  //计算距离，单位MM   MM：0.172  CM：0.0172				
	}
	TH1 = 0;
	TL1 = 0;
}
